---
kind: method
id: M:Autodesk.Revit.UI.TextEditorOptions.Dispose
source: html/d1444b92-06ea-7d60-e544-a2be7b0ca64c.htm
---
# Autodesk.Revit.UI.TextEditorOptions.Dispose Method

Releases all resources used by the TextEditorOptions

## Syntax (C#)
```csharp
public void Dispose()
```